<a href="https://colab.research.google.com/github/Jagadeeshkavuri1/ML_assignment/blob/main/assianment-2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as k

#(1) i) Create a Pandas DataFrame from the following dictionary:

In [15]:
data = {
'Name': ['Alice', 'Bob', 'Carol'],
'Age': [24, 27, 22],
'Salary': [50000, 55000, 48000]
}
d=k.DataFrame(data)
print("the dataframe of the give data is \n",d)

the dataframe of the give data is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000

##(ii)Add a new column called Bonus which is 10% of the salary.

In [16]:
print(d)
print("---------------------------")
df['Bonus'] = df['Salary'] * 0.10
print(d)

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
---------------------------
    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000

#2) Given the DataFrame created in the above question:

##(i)Display the first two rows.

In [19]:
print("the dataframe is \n",d)
print("the first two rows of the above data frame is \n")
d1=d.head(2)
print(d1)

the dataframe is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
the first two rows of the above data frame is

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000

##(ii)Compute the mean salary

In [22]:
print("the dataframe is \n",d)
m_sal=d['Salary'].mean()
print("mean of the salary is : ",m_sal)

the dataframe is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
mean of the salary is :  51000.0

#3) Using the same DataFrame:

##(i) Extract all rows where the Age is greater than 25.

In [27]:
print("the dataframe is \n",d)
grea_age=d[d['Age']>25]
print("age is greatther than 25 is \n",grea_age)

the dataframe is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
age is greatther than 25 is
   Name  Age  Salary
1  Bob   27   55000

##(ii) Filter out rows where the Salary is less than 50000.

In [29]:
print("the dataframe is \n",d)
sal=d[d['Salary']<50000]
print("salary is lesser than 50000 is \n",sal)

the dataframe is
     Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
salary is lesser than 50000 is
     Name  Age  Salary
2  Carol   22   48000

#4) Create the following DataFrame:

In [19]:
data1 = {
'A': [1, 2, None, 4],
'B': [None, 2, 3, None],
'C': [1, 2, 3, 4]
}
d2=k.DataFrame(data1)
d1=d2
print("the dataframe is\n\n ",d2)

the dataframe is

       A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4

##(i) Fill missing values in column A with the mean of the column.

In [20]:
print("origiinal dataframe is\n :",d1)
d2['A'] = d2['A'].fillna(d2['A'].mean())
print(d2)

origiinal dataframe is
 :      A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

##(ii)Drop rows where all values are None.

In [23]:
print('original dataframe is\n ',d1)
d_drop_col = d2.dropna(how='all')
print("remove the all none rows of dataframe \n ")
print(d_drop_col)

original dataframe is
            A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4
remove the all none rows of dataframe

          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

#(5) Create a DataFrame for employees

In [24]:
data3 = {
'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
'Salary': [50000, 45000, 60000, 65000, 70000]
}
d4=k.DataFrame(data3)
print("the dataframe of the data is ")
print(d4)

the dataframe of the data is
  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   45000
2         IT    Carol   60000
3         IT    David   65000
4    Finance      Eve   70000

##i) Group the data by Department and compute the total and mean salary for each department.

In [25]:
grouped = d4.groupby('Department')['Salary'].agg(['sum', 'mean'])

print(grouped)

               sum     mean
Department
Finance      70000  70000.0
HR           95000  47500.0
IT          125000  62500.0

#(6)Perform an inner join on the ID column.  Given two DataFrames

In [28]:
df1 = k.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
print("the first dataframe is \n",df1)

df2 = k.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
print("the second dataframes is \n",df2)
m=k.merge(df1,df2,how='inner',on='ID')
print("after perform inner join \n",m)

the first dataframe is
    ID   Name
0   1  Alice
1   2    Bob
2   3  Carol
the second dataframes is
    ID  Age
0   2   25
1   3   30
2   4   22
after perform inner join
    ID   Name  Age
0   2    Bob   25
1   3  Carol   30

#(7)Given a small dataset, clean and display basic statistics using Pandas.

In [29]:
data9 = {
    'Name': ['Alice', 'Bob', 'Carol'],
    'Age': [25, 30, None],
    'Salary': [50000, 55000, 60000],
    'Department': ['HR', 'IT', 'Finance']
}
df9 = k.DataFrame(data9)
print("Original DataFrame:")
print(df9)
df9['Age'].fillna(df9['Age'].mean(), inplace=True)
df9.drop_duplicates(inplace=True)
print("\nDataFrame after cleaning:")
print(df9)
print("\nBasic Statistics:")
print(df9.describe())
print("\nDataFrame Info:")
print(df9.info())

Original DataFrame:
    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   55000         IT
2  Carol   NaN   60000    Finance

DataFrame after cleaning:
    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   55000         IT
2  Carol  27.5   60000    Finance

Basic Statistics:
         Age   Salary
count   3.00      3.0
mean   27.50  55000.0
std     2.50   5000.0
min    25.00  50000.0
25%    26.25  52500.0
50%    27.50  55000.0
75%    28.75  57500.0
max    30.00  60000.0

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Age         3 non-null      float64
 2   Salary      3 non-null      int64
 3   Department  3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 224.0+ bytes
None

<ipython-input-29-676f051f5e81>:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df9['Age'].fillna(df9['Age'].mean(), inplace=True)

#(8)

#(9)Data Transformation Load a dataset containing daily temperatures and dates. Perform the following:

In [30]:
data5 = {
    'Date': ['2024-12-01', '2024-12-02', '2024-12-03', '2024-12-04', '2024-12-05'],
    'Temperature': [30, 25, 18, 35, 22]
}
g4=k.DataFrame(data5)
print(g4)

         Date  Temperature
0  2024-12-01           30
1  2024-12-02           25
2  2024-12-03           18
3  2024-12-04           35
4  2024-12-05           22

##(i) Convert the date column into a DateTime object.

##(ii)o Create a new column that categorizes temperatures into High, Medium, or Low.